import { Center, Box, Stack, Flex } from "@chakra-ui/layout";
import { __ } from "../../utils";
import { Text, Button, IconButton } from "@chakra-ui/react";
import { MailIcon } from "../../Icons";
import { ArrowForwardIcon } from "@chakra-ui/icons";
export default function () {
  //const arr = new Array(5).fill(0);
  const data = [
    {
      title: "Иргэний нийгмийн эвсэлийн дүрэм",
      desc:
        "Боловсрол нь хүн бүрийн өдөр тутмын амьдралд, насан турш нөлөөлөх үндсэн эрх, хүний хөгжлийн түлхүүр бөгөөд иргэн бүрт чанартай боловсрол олгох нь төрийн хүлээх гол үүрэг хариуцлага гэдэгт итгэн Өнөөгийн тогтолцоонд боловсролыг явцуу тодорхойлдог, хүн бүрийн ялгаатай байдлыг харгалздаггүй, ялгаварлан гадуурхдаг, хангалттай санхүүжилт олгодоггүй зэргээс шалтгаалан бодлого төлөвлөх, хэрэгжүүлэх үйл явцад цогц хандлага дутагдаж; боловсролын тогтолцооны үр өгөөж нь хувь хүний хүсэл тэмүүлэл, нийгмийн эрэлт хэрэгцээнээс асар зөрүүтэй байсаар ирсний улмаас үнэ цэнэтэй амьдарч, амьдралын чанараа дээшлүүлэх боломж олгохгүй байгаад сэтгэл зовнин; ",
    },
    {
      title: "Иргэний нийгмийн үндэсний эвсэлийн гишүүнчлэл хөгжүүлэх бодлого",
      desc:
        "Бүх нийт боловсролын төлөө” Иргэний нийгмийн үндэсний эвсэл нь (цаашид эвсэл гэх) төрөөс болон аливаа улс төр, эдийн засгийн явцуу ашиг сонирхлоос хараат бус, үл намчирхдаг, íèéãýìä ¿éë÷èëäýã, àøãèéí áóñ, төрийн бус байгууллага мөн. Эâñýë íü уг эвслийн дүрмийг хүлээн зөвшөөрч, ардчилсан зарчмын үндсэн дээр эвлэлдэн нэгдсэн хувь хүн, бүлгүүд, иргэний нийгмийн байгууллагуудын сайн дурын, чөлөөт нэгдэл юм. ",
    },
    {
      title: "Ашиг, сонирхлын зөрчлийн бодлого ",
      desc:
        "Энэхүү бодлого нь Эвслийн Удирдах зөвлөлийн гишүүдэд хамаарна. Удирдах зөвлөлийн гишүүд нь өөрсдийн хувийн үйл ажиллагаа болон Эвслийн өмнө хүлээсэн хариуцлага хоёрыг ямар нэг ашиг сонирхлын зөрчилгүй байлгах ёстой. Энэ үүднээс ашиг сонирхлын зөрчил илрэхээс зайлсхийнэ. ",
    },
    {
      title: "Стратегийн баримт бичгийн танилцуулга ",
      desc:
        "2019 он эвслийн стратегийн төлөвлөлтийг нухацтай хийх, хүрэх үр дүн, түүнийг хэмжих шалгуур үзүүлэлтүүдээ нарийвчлан тодорхойлох, 2020 оны сонгууль зэрэг эрсдлүүдийг аль болох бүрэн тооцох, холбоо харилцааны, мониторингийн төлөвлөгөө болон хөрөнгө босгох стратегиа боловсруулах, дараагийн 3 жилийн стратегийн хэрэгжилтийн бэлтгэлийг хангах жил байна. Мөн түүнчлэн тоон болон чанарын дата цуглуулан боловсролын салбарын өнөөгийн нөхцөл байдлын талаар бүрэн зураглалтай болсон байна. Өөрчлөлтийн онол боловсруулах, дараагийн 2 жилд санхүүжилт авах төслийн баримт бичгийг боловсруулна.  ",
    },
  ];
  return (
    <Box>
      <Center>
        <Text fontSize="3xl" fontWeight="bold">
          {__("Rules")}
        </Text>
      </Center>
      <Stack spacing={4}>
        {data.map((el, ind) => (
          <Stack
            p={3}
            spacing={4}
            key={ind}
            border="1px solid black"
            borderRadius={
              ind % 2 === 0 ? "16px 16px 0 16px" : "16px 0 16px 16px "
            }
          >
            <Text fontWeight="bold" fontSize="2xl">
              {el.title}
            </Text>
            <Text>{el.desc}</Text>
            <Flex justifyContent="flex-end">
              <Button variant="link" colorScheme="dark">
                {__("Read more")}
              </Button>
            </Flex>
          </Stack>
        ))}
        <Stack
          direction="row"
          justifyContent="space-between"
          spacing={4}
          alignItems="center"
          w="100%"
          p={3}
          border="1px solid #0398FC"
          borderRadius="30px"
        >
          <Flex alignItems="center">
            <MailIcon
              width="5"
              height="5"
              viewBox="0 0 22 20"
              fill="brand.500"
            />
            <Box pl={2}>
              <Text
                textTransform="capitalize"
                fontWeight="bold"
                color="brand.500"
                fontSize="12px"
              >
                {__("join us our team")}
              </Text>
              <Text opacity="0.5">132456@examplemail.com</Text>
            </Box>
          </Flex>
          <IconButton
            variant="ghost"
            borderRadius="30px"
            color="brand.500"
            icon={<ArrowForwardIcon />}
          />
        </Stack>
      </Stack>
      <Text fontSize="12px" fontWeight="bold">
        {__("Гишүүн байгууллагаар элсэхийн тулд цахим шуудан илгээнэ үү!")}
      </Text>
      <Box h="2rem"></Box>
    </Box>
  );
}
